
## Plan Result




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ams_function_app.azurerm_application_insights.appinsight
  * module.ams_function_app.azurerm_linux_function_app.this[0]
  * module.ams_function_app.azurerm_service_plan.this[0]
  * module.ams_function_app.azurerm_storage_account.this
  * module.timestamp_function_app.azurerm_application_insights.appinsight
  * module.timestamp_function_app.azurerm_service_plan.this[0]
  * module.timestamp_function_app.azurerm_storage_account.this
  * module.timestamp_function_app.azurerm_windows_function_app.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ams_function_app.azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "pre-pre-ams-integration-stg"
      + resource_group_name                   = "pre-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # module.ams_function_app.azurerm_linux_function_app.this[0] will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                      = {
          + "ALGO"                              = "['RS256']"
          + "AMS_EVENT_LOGS_CONTAINER_NAME"     = "ams-event-logs"
          + "AUDIENCE"                          = "api://dts_pre_stg"
          + "AZURE_CLIENT_ID"                   = "dts_pre_stg"
          + "AZURE_CLIENT_SECRET"               = (sensitive value)
          + "AZURE_MEDIA_SERVICES_ACCOUNT_NAME" = "preamsstg"
          + "AZURE_RESOURCE_GROUP"              = "pre-stg"
          + "AZURE_STORAGE_ACCOUNT_KEY"         = (sensitive value)
          + "AZURE_STORAGE_ACCOUNT_NAME"        = "prefinalsastg"
          + "AZURE_SUBSCRIPTION_ID"             = "74dacd4f-a248-45bb-a2f0-af700dc4cf68"
          + "AZURE_TENANT_ID"                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          + "CONTENTPOLICYKEYNAME"              = "PolicyWithClearKeyOptionAndJwtTokenRestriction"
          + "ISSUER"                            = "https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/"
          + "JWKSURI"                           = "https://login.microsoftonline.com/common/discovery/keys"
          + "PREFINALSASTG_KEY"                 = (sensitive value)
          + "PREINGESTSASTG_KEY"                = (sensitive value)
          + "SCOPE"                             = "api://dts_pre_stg/.default"
          + "STREAMINGPOLICYNAME"               = "PreStreamingPolicy"
          + "SYMMETRICKEY"                      = (sensitive value)
          + "TOKENENDPOINT"                     = "https://login.microsoftonline.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/oauth2/token"
          + "WEBSITE_ENABLE_SYNC_UPDATE_SITE"   = "false"
        }
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "pre-ams-integration-stg"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "pre-stg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "preamsintegrationstg"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "18"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.ams_function_app.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "pre-asp-pre-ams-integration"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "pre-stg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + worker_count                 = (known after apply)
    }

  # module.ams_function_app.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "preamsintegrationstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.timestamp_function_app.azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "pre-pre-timestamp-mgmt-stg"
      + resource_group_name                   = "pre-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
    }

  # module.timestamp_function_app.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "pre-asp-pre-timestamp-mgmt"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "pre-stg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + worker_count                 = (known after apply)
    }

  # module.timestamp_function_app.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "pretimestampmgmtstg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "pre-stg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.timestamp_function_app.azurerm_windows_function_app.this[0] will be created
  + resource "azurerm_windows_function_app" "this" {
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "pre-timestamp-mgmt-stg"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + public_network_access_enabled     = true
      + resource_group_name               = "pre-stg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "pretimestampmgmtstg"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"         = "pre-recorded-evidence"
          + "builtFrom"           = "https://github.com/HMCTS/pre-functions.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + zip_deploy_file                   = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)

          + application_stack {
              + dotnet_version              = (known after apply)
              + java_version                = (known after apply)
              + node_version                = (known after apply)
              + powershell_core_version     = (known after apply)
              + use_custom_runtime          = (known after apply)
              + use_dotnet_isolated_runtime = (known after apply)
            }
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1,"Program":"tfcmt","SHA1":"","Vars":{}} -->